第二轮测试截图/PROF00-珠海自助通发票管理/路桥凭条打印查询-测试数据.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://gdeupsb.service.bankcomm.com/basic/atomic/operation.GDEUPSPROF00Service/Schema" xmlns:gsp="http://gsp.bankcomm.com" xmlns:bbip="http://bbip.bankcomm.com">
   <soapenv:Body>
      <sch:queryPrintInvoice>
        <gsp:requestInformation>
            <gsp:traceNo>20150212000001</gsp:traceNo>
            <gsp:version>1.0</gsp:version>
         </gsp:requestInformation>
         <sch:request>
            <sch:requestHeader>
               <bbip:bbipRequestHead>
                  <bbip:chn>00</bbip:chn>
                  <bbip:reqJrnNo>20150212000001</bbip:reqJrnNo>
                  <bbip:tlr>1234567</bbip:tlr>
                  <bbip:br>01441101001</bbip:br>
                  <bbip:bk>441999</bbip:bk>
                  <bbip:tlrTmlId>441101A</bbip:tlrTmlId>
                   <bbip:authLvl>40</bbip:authLvl>
                  <bbip:sup1Id>4411235</bbip:sup1Id>
                  <bbip:sup1Auth>40</bbip:sup1Auth>
                  <bbip:reqTme>2015-02-12T12:12:12</bbip:reqTme>
               </bbip:bbipRequestHead>
            </sch:requestHeader>
            <sch:eupsBusTyp>PROF00</sch:eupsBusTyp>
            <sch:carNo>C50692</sch:carNo>
            <sch:carType>A2</sch:carType>
            <sch:actNo>60142860781589901</sch:actNo>
         </sch:request>
      </sch:queryPrintInvoice>
   </soapenv:Body>
</soapenv:Envelope>